_posts/2015-08-06-lfe-and-pynchon.html
---
layout: post
title:  "Lisp Flavoured Erlang and Pynchon, oh my!"
date:   Thu 2015-08-06 05:43:33 CDT 2015
---

<p>
So, lately I've been getting increasingly into <a href="http://lfe.io">Lisp Flavoured Erlang (LFE)</a>.  If
you haven't tried it yet, or even if you have, check out the <a href="http://help.exercism.io/getting-started-with-lfe.html">Exercism.io track</a> I
helped organize.  My latest endeavour is porting Robert Levy's <a href="https://github.com/rplevy/swiss-arrows">swiss-arrows</a> from
Clojure to LFE.  It's been going well so far, despite having to rename it to
<a href="https://github.com/yurrriq/pynchon">pynchon</a>, since Erlang wasn't down with the hyphenated name and a few people on
the <a href="https://groups.google.com/forum/#!aboutgroup/lisp-flavoured-erlang">LFE Google group</a> suggested it.
</p>


<p>
Without further ado, here's a contrived example:
</p>
<div class="org-src-container">

<pre class="src src-lfe"><span style="color: #A1EFE4;">(</span>-&lt;&gt; <span style="color: #E6DB74;">"testing"</span>
     <span style="color: #E6DB74;">(</span>-!&lt;&gt;&gt; <span style="color: #66D9EF;">(</span>string:substr &lt;&gt; 1 4<span style="color: #66D9EF;">)</span>
            <span style="color: #66D9EF;">(</span>lists:duplicate 3<span style="color: #66D9EF;">)</span>
            <span style="color: #66D9EF;">(</span>compose #'list/1 #'lists:flatten/1<span style="color: #66D9EF;">)</span>
            <span style="color: #66D9EF;">(</span>lfe_io:format '<span style="color: #E6DB74;">"non-updating: ~p\n"</span><span style="color: #66D9EF;">)</span><span style="color: #E6DB74;">)</span>
     <span style="color: #E6DB74;">(</span>string:substr 5<span style="color: #E6DB74;">)</span>
     <span style="color: #E6DB74;">(</span><span style="color: #F92672;">++</span> <span style="color: #E6DB74;">"winn"</span> &lt;&gt;<span style="color: #E6DB74;">)</span><span style="color: #A1EFE4;">)</span>
</pre>
</div>

<p>
<b>Note</b>: <code>#'compose/2</code> comes from Duncan McGreggor's <a href="https://github.com/lfex/clj">clj</a>, Clojure functions and
macros for LFE.
</p>

<p>
The wild-looking form above expands to something more like:
</p>
<div class="org-src-container">

<pre class="src src-lfe"><span style="color: #A1EFE4;">(</span>-&lt;&gt;
 <span style="color: #E6DB74;">(</span><span style="color: #F92672;">progn</span>
   <span style="color: #66D9EF;">(</span>lfe_io:format
    '<span style="color: #E6DB74;">"non-updating: ~p\n"</span>
    <span style="color: #FD971F;">(</span><span style="color: #F92672;">list</span>
     <span style="color: #A6E22E;">(</span>lists:flatten
      <span style="color: #E6DB74;">(</span>lists:duplicate 3 <span style="color: #66D9EF;">(</span>string:substr <span style="color: #E6DB74;">"testing"</span> 1 4<span style="color: #66D9EF;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #FD971F;">)</span><span style="color: #66D9EF;">)</span>
   <span style="color: #E6DB74;">"testing"</span><span style="color: #E6DB74;">)</span>
 <span style="color: #E6DB74;">(</span>string:substr 5<span style="color: #E6DB74;">)</span>
 <span style="color: #E6DB74;">(</span><span style="color: #F92672;">++</span> <span style="color: #E6DB74;">"winn"</span> &lt;&gt;<span style="color: #E6DB74;">)</span><span style="color: #A1EFE4;">)</span>
</pre>
</div>

<p>
After that, it becomes apparent the "return track" is rather simple:
</p>
<div class="org-src-container">

<pre class="src src-lfe"><span style="color: #A1EFE4;">(</span><span style="color: #F92672;">++</span> <span style="color: #E6DB74;">"winn"</span> <span style="color: #E6DB74;">(</span>string:substr 5 <span style="color: #E6DB74;">"testing"</span><span style="color: #E6DB74;">)</span><span style="color: #A1EFE4;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lfe">&gt; <span style="color: #A1EFE4;">(</span>-&lt;&gt; <span style="color: #E6DB74;">"testing"</span>
       <span style="color: #E6DB74;">(</span>-!&lt;&gt;&gt; <span style="color: #66D9EF;">(</span>string:substr &lt;&gt; 1 4<span style="color: #66D9EF;">)</span>
              <span style="color: #66D9EF;">(</span>lists:duplicate 3<span style="color: #66D9EF;">)</span>
              <span style="color: #66D9EF;">(</span>compose #'list/1 #'lists:flatten/1<span style="color: #66D9EF;">)</span>
              <span style="color: #66D9EF;">(</span>lfe_io:format '<span style="color: #E6DB74;">"non-updating: ~p\n"</span><span style="color: #66D9EF;">)</span><span style="color: #E6DB74;">)</span>
       <span style="color: #E6DB74;">(</span>string:substr 5<span style="color: #E6DB74;">)</span>
       <span style="color: #E6DB74;">(</span><span style="color: #F92672;">++</span> <span style="color: #E6DB74;">"winn"</span> &lt;&gt;<span style="color: #E6DB74;">)</span><span style="color: #A1EFE4;">)</span>
non-updating: <span style="color: #E6DB74;">"testtesttest"</span> <span style="color: #75715E;">; printed</span>
<span style="color: #E6DB74;">"winning"</span>                    <span style="color: #75715E;">; returned</span>
</pre>
</div>
